mongo_metrics/modified_run_e_mongo_threads_001_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloade -threads 1 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 16669
[OVERALL], Throughput(ops/sec), 59.991601175835385
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 17
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10198572199892014
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 0.10198572199892014
[READ], Operations, 44
[READ], AverageLatency(us), 3797.7727272727275
[READ], MinLatency(us), 394
[READ], MaxLatency(us), 8975
[READ], 95thPercentileLatency(us), 7231
[READ], 99thPercentileLatency(us), 8975
[READ], Return=OK, 44
[SCAN-FAILED], Operations, 625
[SCAN-FAILED], AverageLatency(us), 17281.9008
[SCAN-FAILED], MinLatency(us), 12624
[SCAN-FAILED], MaxLatency(us), 34399
[SCAN-FAILED], 95thPercentileLatency(us), 21327
[SCAN-FAILED], 99thPercentileLatency(us), 28239
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3985.0
[CLEANUP], MinLatency(us), 3984
[CLEANUP], MaxLatency(us), 3985
[CLEANUP], 95thPercentileLatency(us), 3985
[CLEANUP], 99thPercentileLatency(us), 3985
[SCAN], Operations, 331
[SCAN], AverageLatency(us), 16208.504531722054
[SCAN], MinLatency(us), 800
[SCAN], MaxLatency(us), 36127
[SCAN], 95thPercentileLatency(us), 21183
[SCAN], 99thPercentileLatency(us), 28783
[SCAN], Return=OK, 331
[SCAN], Return=ERROR, 625