mongo_metrics/modified_run_e_mongo_threads_002_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloade -threads 2 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 8677
[OVERALL], Throughput(ops/sec), 115.24720525527256
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 9
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10372248472974531
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 9
[TOTAL_GC_TIME_%], Time(%), 0.10372248472974531
[READ], Operations, 67
[READ], AverageLatency(us), 4375.641791044776
[READ], MinLatency(us), 670
[READ], MaxLatency(us), 7995
[READ], 95thPercentileLatency(us), 7171
[READ], 99thPercentileLatency(us), 7687
[READ], Return=OK, 67
[SCAN-FAILED], Operations, 606
[SCAN-FAILED], AverageLatency(us), 17912.37623762376
[SCAN-FAILED], MinLatency(us), 12152
[SCAN-FAILED], MaxLatency(us), 38399
[SCAN-FAILED], 95thPercentileLatency(us), 22255
[SCAN-FAILED], 99thPercentileLatency(us), 30303
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 893.5
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 1784
[CLEANUP], 95thPercentileLatency(us), 1784
[CLEANUP], 99thPercentileLatency(us), 1784
[SCAN], Operations, 327
[SCAN], AverageLatency(us), 16968.079510703363
[SCAN], MinLatency(us), 599
[SCAN], MaxLatency(us), 42495
[SCAN], 95thPercentileLatency(us), 21583
[SCAN], 99thPercentileLatency(us), 32015
[SCAN], Return=OK, 327
[SCAN], Return=ERROR, 606