mongo_metrics/modified_run_e_mongo_threads_004_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloade -threads 4 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 5662
[OVERALL], Throughput(ops/sec), 176.61603673613564
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 22
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3885552808194984
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 22
[TOTAL_GC_TIME_%], Time(%), 0.3885552808194984
[READ], Operations, 54
[READ], AverageLatency(us), 5617.148148148148
[READ], MinLatency(us), 287
[READ], MaxLatency(us), 15463
[READ], 95thPercentileLatency(us), 12623
[READ], 99thPercentileLatency(us), 14799
[READ], Return=OK, 54
[SCAN-FAILED], Operations, 621
[SCAN-FAILED], AverageLatency(us), 22627.201288244767
[SCAN-FAILED], MinLatency(us), 13536
[SCAN-FAILED], MaxLatency(us), 73983
[SCAN-FAILED], 95thPercentileLatency(us), 34335
[SCAN-FAILED], 99thPercentileLatency(us), 48991
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 800.5
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 3197
[CLEANUP], 95thPercentileLatency(us), 3197
[CLEANUP], 99thPercentileLatency(us), 3197
[SCAN], Operations, 325
[SCAN], AverageLatency(us), 20103.63076923077
[SCAN], MinLatency(us), 1955
[SCAN], MaxLatency(us), 56607
[SCAN], 95thPercentileLatency(us), 30047
[SCAN], 99thPercentileLatency(us), 36767
[SCAN], Return=OK, 325
[SCAN], Return=ERROR, 621