mongo_metrics/modified_run_e_mongo_threads_008_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloade -threads 8 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 5602
[OVERALL], Throughput(ops/sec), 178.5076758300607
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 32
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5712245626561943
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 32
[TOTAL_GC_TIME_%], Time(%), 0.5712245626561943
[READ], Operations, 54
[READ], AverageLatency(us), 11963.685185185184
[READ], MinLatency(us), 1325
[READ], MaxLatency(us), 69567
[READ], 95thPercentileLatency(us), 21855
[READ], 99thPercentileLatency(us), 29023
[READ], Return=OK, 54
[SCAN-FAILED], Operations, 604
[SCAN-FAILED], AverageLatency(us), 43140.15894039735
[SCAN-FAILED], MinLatency(us), 13928
[SCAN-FAILED], MaxLatency(us), 115839
[SCAN-FAILED], 95thPercentileLatency(us), 71103
[SCAN-FAILED], 99thPercentileLatency(us), 91967
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 394.25
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 3145
[CLEANUP], 95thPercentileLatency(us), 3145
[CLEANUP], 99thPercentileLatency(us), 3145
[SCAN], Operations, 342
[SCAN], AverageLatency(us), 40044.38596491228
[SCAN], MinLatency(us), 3188
[SCAN], MaxLatency(us), 112575
[SCAN], 95thPercentileLatency(us), 69887
[SCAN], 99thPercentileLatency(us), 91839
[SCAN], Return=OK, 342
[SCAN], Return=ERROR, 604